import { useState } from 'react';
import Modal from 'react-modal';

const rulesText = `
   <h1>Правила користування ігровими автоматами</h1>
  <p>Прошу уважно ознайомитися з нашими правилами користування ігровими автоматами. Ваш доступ та використання нашого сайту для гри на ігрових автоматах підлягають дотриманню цих правил.</p>
  <ol>
    <li>
      <h3>Вікові обмеження</h3>
      <p>Ви підтверджуєте, що вам виповнилося не менше 18 років. Ми забезпечуємо доступ лише для осіб, які досягли вікового обмеження для гральних ігор.</p>
    </li>
    <li>
      <h3>Створення облікового запису</h3>
      <p>Для гри на ігрових автоматах потрібно створити особистий обліковий запис. Будь ласка, надайте правдиві та точні дані при реєстрації.</p>
    </li>
    <li>
      <h3>Відповідальна гра</h3>
      <p>Ви розумієте, що гра на ігрових автоматах повинна бути відповідальною та розважальною. Будь ласка, уникайте використання гри як способу вирішення фінансових труднощів.</p>
    </li>
    <li>
      <h3>Обмеження часу гри</h3>
      <p>Ми рекомендуємо вам встановити обмеження на час гри, щоб забезпечити розумну тривалість гри та запобігти надмірному гральному процесу.</p>
    </li>
    <li>
      <h3>Фінансові обмеження</h3>
      <p>Для вашої безпеки і контролю над бюджетом гри, вам рекомендується встановити обмеження на депозит та витрати.</p>
    </li>
    <li>
      <h3>Відстеження активності</h3>
      <p>Ми забезпечуємо можливість відстежування вашої гральної активності, включаючи виграші та витрати.</p>
    </li>
    <li>
      <h3>Захист від неповнолітніх</h3>
      <p>Ми робимо всі можливе, щоб захистити неповнолітніх осіб від доступу до гральних ігор на нашому сайті.</p>
    </li>
    <li>
      <h3>Попередження про ризики</h3>
      <p>Ви маєте розуміти, що гра на ігрових автоматах несе ризики втрати грошей. Будь ласка, грайте розсудливо та усвідомлено.</p>
    </li>
    <li>
      <h3>Підтримка гравців</h3>
      <p>Наша служба підтримки готова вам допомогти. Будь ласка, звертайтесь за необхідною допомогою та інформацією.</p>
    </li>
    <li>
      <h3>Заборона маніпуляцій</h3>
      <p>Ми суворо забороняємо будь-які спроби обману, використання шахрайських програм або фальшивих даних.</p>
    </li>
    <li>
      <h3>Політика конфіденційності</h3>
      <p>Ваші особисті дані обробляються згідно з нашою політикою конфіденційності. Будь ласка, докладно ознайомтесь з цим документом.</p>
    </li>
    <li>
      <h3>Ліцензія та регуляція</h3>
      <p>Ми маємо валідну ліцензію на надання гральних послуг. Номер ліцензії та регуляторна інформація доступні для ознайомлення.</p>
    </li>
  </ol>
  <p>Будь ласка, натисніть кнопку "Погоджуюся", якщо ви ознайомилися з цими правилами та приймаєте їх умови.</p>
`;

const RulesModal = () => {
  const [modalIsOpen, setModalIsOpen] = useState(false);

  const openModal = () => {
    setModalIsOpen(true);
  };

  const closeModal = () => {
    setModalIsOpen(false);
  };

  return (
    <div
      style={{
        marginLeft: 5,
      }}
    >
      <button
        style={{
          border: 'none',
          background: 'transparent',
          color: 'rgba(13, 110, 43, 1)',
          textDecoration: 'underline',
        }}
        onClick={openModal}
      >
        правилами
      </button>
      <Modal
        isOpen={modalIsOpen}
        onRequestClose={closeModal}
        contentLabel="Правила користування"
      >
        <div dangerouslySetInnerHTML={{ __html: rulesText }} />
        <button onClick={closeModal}>Закрити</button>
      </Modal>
    </div>
  );
};

export { RulesModal };
